# taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# brew
brew "bash"
brew "bash-completion"
brew "zsh"
brew "git"
brew "git-delta"
brew "git-branchless"
brew "gnupg2"
brew "aria2"
brew "wget"
brew "make"
brew "cmake"
brew "readline"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "bat"
brew "beeftornado/rmtree/brew-rmtree"
brew "clang-format"
brew "eth-p/software/bat-extras-batgrep"
brew "eth-p/software/bat-extras-batdiff"
brew "eth-p/software/bat-extras-batman"
brew "eth-p/software/bat-extras-batpipe"
brew "eth-p/software/bat-extras-batwatch"
brew "eth-p/software/bat-extras-prettybat", args: ["ignore-dependencies"]
brew "fabianishere/personal/pam_reattach"
brew "jq"
brew "known_hosts"
brew "neovim"
brew "pyenv"
brew "rbenv"
brew "nodenv"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-update"
brew "rg"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "tmux"
brew "yarn", args: ["ignore-dependencies"]
brew "pinentry-mac"
brew "duf"
brew "dust"
brew "fx"
brew "lsd"

# cask
cask "adobe-acrobat-reader"
cask "alfred"
cask "android-file-transfer"
cask "cameracontroller"
cask "dash"
cask "google-chrome"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "kap"
cask "keka"
cask "osxfuse"
cask "kitty"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "scroll-reverser"
cask "simplefloatingclock"
cask "spotify"
cask "suspicious-package"
cask "vimr"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "yubico-yubikey-personalization-gui"
