# taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "beeftornado/rmtree"
tap "eth-p/software"
tap "fabianishere/personal"
tap "heroku/brew"
tap "nodenv/nodenv"

# brew
brew "antibody"
brew "aria2"
brew "bash"
brew "bash-completion"
brew "beeftornado/rmtree/brew-rmtree"
brew "bottom"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "duf"
brew "dust"
brew "eth-p/software/bat-extras-batdiff"
brew "eth-p/software/bat-extras-batgrep"
brew "eth-p/software/bat-extras-batman"
brew "eth-p/software/bat-extras-batpipe"
brew "eth-p/software/bat-extras-batwatch"
brew "eth-p/software/bat-extras-prettybat", args: ["ignore-dependencies"]
brew "fabianishere/personal/pam_reattach"
# brew "ffmpeg"
brew "findutils"
brew "fx"
brew "gawk"
brew "ghostscript"
brew "git"
brew "git-branchless"
brew "gnupg"
brew "goenv"
brew "gsed"
# brew "java11" unless system "/usr/libexec/java_home --failfast"
brew "jq"
brew "known_hosts"
brew "libvterm"
brew "lsd"
brew "mdcat"
brew "moreutils"
brew "neovim"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-update"
brew "pinentry-mac"
brew "pyenv-pip-migrate"
brew "rbenv"
brew "rlwrap"
brew "shellcheck"
brew "tmux"
brew "watch"
brew "wget"
brew "zsh"

# cask
cask "adobe-acrobat-reader"
cask "alfred"
cask "android-file-transfer"
cask "dash"
cask "dropbox"
cask "google-chrome"
cask "kap"
cask "keka"
cask "kitty"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "scroll-reverser"
cask "suspicious-package"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "yubico-yubikey-personalization-gui"
