# vim:foldmethod=marker

# region Core {{{
tap "homebrew/core"
tap "homebrew/bundle", "https://github.com/Homebrew/homebrew-bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
# endregion }}}

# region Taps {{{
tap "beeftornado/rmtree"
tap "eth-p/software"
tap "fabianishere/personal"
tap "jorgelbg/tap"
tap "nodenv/nodenv"
tap "rahuliyer95/personal"
# endregion }}}

# region Formula {{{
brew "ansifilter"
brew "antidote"
brew "automake"
brew "bash-completion"
brew "bat"
brew "beeftornado/rmtree/brew-rmtree"
brew "blueutil"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "dive"
brew "docker", link: false
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eth-p/software/bat-extras-batdiff"
brew "eth-p/software/bat-extras-batgrep"
brew "eth-p/software/bat-extras-batman"
brew "eth-p/software/bat-extras-batpipe"
brew "eth-p/software/bat-extras-batwatch"
brew "eth-p/software/bat-extras-prettybat", args: ["ignore-dependencies"]
brew "fabianishere/personal/pam_reattach"
brew "fd"
# brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
# brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
# brew "goenv"
brew "highlight"
# brew "htop"
brew "jorgelbg/tap/pinentry-touchid"
brew "jq"
brew "kind"
brew "known_hosts"
brew "lsd"
brew "neovim"
brew "nodenv"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-update"
# brew "openjdk@17", link: true
# brew "openjdk@21"
brew "pam-reattach"
brew "pinentry-mac"
brew "pkg-config"
brew "pkl"
brew "rahuliyer95/personal/pam_watchid"
# brew "rbenv"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "zstd"
# endregion }}}

# region Cask {{{
cask "1password-cli"
cask "1password@beta"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anydesk"
cask "betterdisplay"
# cask "calibre"
cask "dash"
cask "dropbox"
cask "font-0xproto"
cask "font-0xproto-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "kap"
cask "keka"
cask "kekaexternalhelper"
# cask "mactex"
cask "microsoft-edge"
cask "neohtop"
# cask "nordvpn"
cask "notion"
cask "orbstack"
# cask "osxfuse"
cask "qlmarkdown"
cask "raycast"
cask "scroll-reverser"
cask "shortcutdetective"
cask "spotify"
cask "suspicious-package"
cask "syntax-highlight"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "yubico-yubikey-personalization-gui"
cask "zoom"
# endregion }}}

