# vi: ft=Brewfile:foldmethod=marker

# region Taps {{{

tap "beeftornado/rmtree"
tap "eth-p/software"
tap "jorgelbg/tap"
tap "rahuliyer95/personal"

# endregion }}}

# region Formula {{{

brew "ansifilter"
brew "antidote"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bat"
brew "beeftornado/rmtree/brew-rmtree"
brew "blueutil"
brew "brotli"
brew "bzip2"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "dive"
brew "docker", link: false
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eth-p/software/bat-extras-batdiff"
brew "eth-p/software/bat-extras-batgrep"
brew "eth-p/software/bat-extras-batman"
brew "eth-p/software/bat-extras-batpipe"
brew "eth-p/software/bat-extras-batwatch"
brew "eth-p/software/bat-extras-prettybat", args: ["ignore-dependencies"]
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "jorgelbg/tap/pinentry-touchid"
brew "jless"
brew "jq"
brew "lsd"
brew "neovim"
# brew "openjdk@17", link: true
# brew "openjdk@25", link: true
brew "pam-reattach"
brew "pinentry-mac"
brew "rahuliyer95/personal/pam_watchid"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zstd"

# endregion }}}

# region Cask {{{

cask "1password-cli"
cask "1password@beta"
cask "android-file-transfer"
cask "betterdisplay"
cask "betterzip"
cask "dropbox"
cask "font-0xproto-nerd-font"
cask "font-google-sans-code"
cask "font-maple-mono-nf"
cask "font-monaspace-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "kekaexternalhelper"
cask "microsoft-edge"
cask "neohtop"
cask "nordvpn"
cask "notion"
cask "qlmarkdown"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "suspicious-package"
cask "syntax-highlight"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "xquartz"
cask "zoom"

# endregion }}}
